x = str(input("я мобильный помощьник прошу вас выбрать одну из цифр!"))
if x == "3":
    z = str(input(" эту подписку надо КИШМИШШИШМЫШШОШШЩШШИМЫШИШ ?"))
    if z == "1":
        print("подключена подписка")
    else: 
        print("ок пока")
if x == "1":
    c = str(input("прошу вас выбрать одну из цифр!"))
    if c == "1":
        print("у вас есть тариф кикиш")
    if c == "2":
        print("ваш баланс -1000000000000000000000000000000000 рублей")
    if c == "3":
        print("подключ услуга оаррнп")
if x == "2":
    v = str(input("новое предложение для вас сас раппвур вам надо её подключить 1-да 0-нет"))
    if v == "1":
        print("подключено")
    if v == "0":
        print("ну ладно")
if x == "0":
    print("хи-хи-хи-ха иды нуфиг")